danielinux/m33mu/cpu/stm32h5_mmio.c
#define AES_CR_EN        (1u << 0)
#define AES_CR_DATATYPE_SHIFT 1u
#define AES_CR_MODE_SHIFT 3u
#define AES_CR_CHMOD_SHIFT 5u
#define AES_CR_CHMOD_MASK (0x3u << AES_CR_CHMOD_SHIFT)
#define AES_CR_DMAINEN  (1u << 11)
#define AES_CR_DMAOUTEN (1u << 12)
#define AES_CR_CHMOD2   (1u << 16)
#define AES_CR_KEYSIZE  (1u << 18)
#define AES_CR_GCMPH_SHIFT 13u
#define AES_CR_GCMPH_MASK (0x3u << AES_CR_GCMPH_SHIFT)
#define AES_CR_NPBLB_SHIFT 20u
#define AES_CR_IPRST    (1u << 31)

#define AES_SR_CCF      (1u << 0)
#define AES_SR_RDERR    (1u << 1)
#define AES_SR_WRERR    (1u << 2)
#define AES_SR_BUSY     (1u << 3)
#define AES_SR_KEYVALID (1u << 7)

/* HASH register offsets (subset) */
#define HASH_CR   0x000u
#define HASH_DIN  0x004u
#define HASH_STR  0x008u
#define HASH_HRA0 0x00cu
#define HASH_HRA1 0x010u
#define HASH_HRA2 0x014u
#define HASH_HRA3 0x018u
#define HASH_HRA4 0x01cu
#define HASH_IMR  0x020u
#define HASH_SR   0x024u
#define HASH_CSR0 0x0f8u
#define HASH_HR0  0x310u

#define HASH_CR_INIT      (1u << 2)
#define HASH_CR_DATATYPE_SHIFT 4u
#define HASH_CR_MODE      (1u << 6)
#define HASH_CR_ALGO_SHIFT 17u

#define HASH_STR_NBLW_MASK 0x1fu
#define HASH_STR_DCAL      (1u << 8)

#define HASH_SR_DINIS (1u << 0)
#define HASH_SR_DCIS  (1u << 1)
#define HASH_SR_DMAS  (1u << 2)
#define HASH_SR_BUSY  (1u << 3)
#define HASH_SR_NBWP_SHIFT 9u
#define HASH_SR_DINNE (1u << 15)
#define HASH_SR_NBWE_SHIFT 16u

#define TZSC_SECCFGR3_OFFSET 0x18u
#define TZSC_AESSEC_BIT 16u
#define TZSC_HASHSEC_BIT 17u
#define TZSC_RNGSEC_BIT 18u
#define TZSC_SAESSEC_BIT 19u
#define TZSC_PKASEC_BIT 20u

/* EXTI offsets (subset) */
#define EXTI_RTSR1  0x000u
#define EXTI_FTSR1  0x004u
#define EXTI_SWIER1 0x008u
#define EXTI_RPR1   0x00Cu
#define EXTI_FPR1   0x010u
#define EXTI_EXTICR1 0x060u
#define EXTI_EXTICR2 0x064u
#define EXTI_EXTICR3 0x068u
#define EXTI_EXTICR4 0x06Cu
#define EXTI_IMR1   0x080u
#define EXTI_EMR1   0x084u

/* WWDG offsets */
#define WWDG_CR  0x000u
#define WWDG_CFR 0x004u
#define WWDG_SR  0x008u

/* IWDG offsets */
#define IWDG_KR   0x000u
#define IWDG_PR   0x004u
#define IWDG_RLR  0x008u
#define IWDG_SR   0x00Cu
#define IWDG_WINR 0x010u
#define IWDG_EWCR 0x014u

/* GPIO register offsets for local use */
#define GPIO_IDR_OFFSET STM32_GPIO_IDR_OFFSET
#define GPIO_ODR_OFFSET STM32_GPIO_ODR_OFFSET
#define GPIO_MODER_OFFSET STM32_GPIO_MODER_OFFSET

/* MPCBB offsets */
#define MPCBB_CR_OFFSET      0x000u
#define MPCBB_SECCFGR_OFFSET 0x100u
#define MPCBB_CR_INVSECSTATE (1u << 30)

/* FLASH register offsets */
#define FLASH_ACR      0x000u
#define FLASH_NSKEYR   0x004u
#define FLASH_SECKEYR  0x008u
#define FLASH_NSSR     0x020u
#define FLASH_SECSR    0x024u
#define FLASH_NSCR     0x028u
#define FLASH_SECCR    0x02cu
#define FLASH_NSCCR    0x030u
#define FLASH_SECCCR   0x034u
#define FLASH_OPTSR_CUR 0x050u
#define FLASH_OPTSR_PRG 0x054u
#define FLASH_ECCDETR   0x104u
#define FLASH_OTPBLR_CUR 0x090u
#define FLASH_OTPBLR_PRG 0x094u

#define FLASH_KEY1 0x45670123u
#define FLASH_KEY2 0xCDEF89ABu

#define FLASH_FLAG_BSY (1u << 0)
#define FLASH_FLAG_EOP (1u << 16)
#define FLASH_FLAG_PGSERR (1u << 18)

#define FLASH_CR_LOCK (1u << 0)
#define FLASH_CR_PG   (1u << 1)
#define FLASH_CR_SER  (1u << 2)
#define FLASH_CR_BER  (1u << 3)
#define FLASH_CR_STRT (1u << 5)
#define FLASH_CR_SNB_SHIFT 6
#define FLASH_CR_SNB_MASK (V->flash_snb_mask << FLASH_CR_SNB_SHIFT)

#define FLASH_SECTOR_COUNT (V->flash_sector_count)
#define FLASH_BANK_COUNT   2u
#define FLASH_CR_BKSEL     (1u << 31)
#define FLASH_OPTSR_SWAP_BANK (1u << 31)
#define FLASH_OPTSR_PRODUCT_STATE_SHIFT 8u
#define FLASH_OPTSR_PRODUCT_STATE_OPEN  (0xEDu << FLASH_OPTSR_PRODUCT_STATE_SHIFT)

/* TrustZone flash security attribution (RM0517).
 * SECWMx: per-bank secure watermark; sectors [STRT, END] are secure.
 * SECBBxRy: per-bank block-based attribution; each bit marks one sector
 * secure, on top of the watermark (used by wolfBoot's temporary claim
 * of non-secure areas during flash operations). Bank indices are
 * physical, whatever the SWAP_BANK setting. */
#define FLASH_SECBB1R      0x0A0u /* 8 registers, 0xA0..0xBC */
#define FLASH_SECBB2R      0x1A0u /* 8 registers, 0x1A0..0x1BC */
#define FLASH_SECBB_NREGS  (V->flash_secbb_nregs)
#define FLASH_SECWM1R_CUR  0x0E0u
#define FLASH_SECWM1R_PRG  0x0E4u
#define FLASH_SECWM2R_CUR  0x1E0u
#define FLASH_SECWM2R_PRG  0x1E4u
#define FLASH_SECWM_STRT_MASK  (V->flash_secwm_strt_mask)
#define FLASH_SECWM_END_SHIFT  16
#define FLASH_SECWM_EMPTY  (V->flash_secwm_strt_mask) /* STRT=all ones, END=0: no secure sector */

/* Emulator fiction: real STM32H5 silicon has no UID in BSEC, it lives at UID_BASE_NS. */
#define BSEC_UID0_OFFSET 0x014u
#define BSEC_UID1_OFFSET 0x018u
#define BSEC_UID2_OFFSET 0x01Cu

#define BSEC_UID0_VALUE 0xB5EC0001u
#define BSEC_UID1_VALUE 0xB5EC0002u
#define BSEC_UID2_VALUE 0xB5EC0003u

#define UID0_OFFSET 0x000u
#define UID1_OFFSET 0x004u
#define UID2_OFFSET 0x008u

/* Deliberately unlike BSEC_UID*_VALUE so a regression to the BSEC read is detectable. */
#define UID0_VALUE 0xF1D00001u
#define UID1_VALUE 0xF1D00002u
#define UID2_VALUE 0xF1D00003u

struct rcc_state {
    mm_u32 regs[RCC_SIZE / 4];
    mm_u64 cpu_hz;
};

struct pwr_state {
    mm_u32 regs[PWR_SIZE / 4];
};

struct simple_blk {
    mm_u32 regs[GTZC_BLK_SIZE / 4];
};

struct mpcbb_state {
    mm_u32 regs[MPCBB_SIZE / 4];
};

struct rng_state {
    mm_u32 regs[RNG_SIZE / 4];
    mm_u32 dr;
    mm_bool dr_valid;
};

struct exti_state {
    mm_u32 regs[EXTI_SIZE / 4];
};

struct iwdg_state {
    mm_u32 regs[IWDG_SIZE / 4];
    mm_u32 counter;
    mm_u32 prescaler;
    mm_bool running;
    mm_bool write_access;
    mm_u64 accum;
};

struct wwdg_state {
    mm_u32 regs[WWDG_SIZE / 4];
    mm_u32 counter;
    mm_u64 accum;
};

struct flash_state {
    mm_u32 regs[FLASH_SIZE / 4];
    mm_u8 *flash;
    mm_u32 flash_size;
    mm_u32 base_s;
    mm_u32 base_ns;
    const struct mm_flash_persist *persist;
    mm_u32 flags;
    mm_u8 ns_key_stage;
    mm_u8 sec_key_stage;
    mm_bool dualbank_enabled;
    mm_bool swap_active;
};

struct ucpd_state {
    mm_u32 cfgr1;
    mm_u32 cr;
    mm_u32 imr;
    mm_u32 sr;
};

#include "stm32_crypto_priv.h"

static void rcc_update_ready(struct rcc_state *r);
static void rcc_update_sysclk(struct rcc_state *r);
static void pwr_update_vos(struct pwr_state *p);
static void mpcbb_init_defaults(void);
static void flash_sync_option_regs(struct flash_state *f);

static struct rcc_state rcc;
static struct rcc_state rcc_s;
/* Points at rcc_s, or at rcc on parts where the secure alias is just a
 * second view of the same register file. Set with V. */
static struct rcc_state *rcc_sec = &rcc_s;
static struct pwr_state pwr;
static struct simple_blk tzsc_s;
static struct simple_blk tzsc_ns;
static struct simple_blk tzic_s;
static struct simple_blk tzic_ns;
static struct simple_blk sbs;
static struct simple_blk sbs_sec;
static struct simple_blk tamp;
static struct simple_blk bsec;
static struct simple_blk uid;
static struct simple_blk ucpd1;
static struct simple_blk ucpd1_sec;
static struct simple_blk crs;
static struct simple_blk crs_sec;
static struct simple_blk dbgmcu;
static struct simple_blk icache;
static struct simple_blk dcache;
static struct ucpd_state ucpd1_state;
static struct ucpd_state ucpd1_state_sec;
static struct mpcbb_state mpcbb[STM32H5_MPCBB_MAX];
static struct rng_state rng;
static struct hash_state hash_accel;
static struct aes_state aes_accel;
static struct aes_state saes_accel;
static struct pka_state pka_accel;
static struct mm_otfdec *otfdec_state = 0;
static struct exti_state exti;
static struct iwdg_state iwdg;
static struct wwdg_state wwdg;
static struct flash_state flash_ctl;
static void flash_init_secwm_defaults(struct flash_state *f);
static void flash_secwm_save(const struct flash_state *f, mm_u32 out[2]);
static void flash_secwm_restore(struct flash_state *f, const mm_u32 in[2]);
static void flash_apply_secwm_fallback(struct flash_state *f);
static mm_bool flash_sector_attr_secure(struct flash_state *f, mm_u32 offset);
static struct mm_otp otp_state;
static struct stm32_gpio_state gpio[STM32H5_GPIO_MAX]; /* A..K */
static struct stm32_gpdma_state gpdma1;
static struct stm32_gpdma_state gpdma2;
static struct stm32_gpio_ctx gpio_ctx_data[STM32H5_GPIO_MAX * 2]; /* NS + S for each bank */
static void *rng_ctx[2][4];
static struct hash_ctx hash_ctx[2];
static struct aes_ctx aes_ctx[2];
static struct aes_ctx saes_ctx[2];
static struct pka_ctx pka_ctx[2];
static struct mm_nvic *g_rng_nvic = 0;
static struct mm_nvic *g_exti_nvic = 0;
static struct mm_nvic *g_wdg_nvic = 0;

