danielinux/m33mu/cpu/stm32h5_mmio.c
#define RNG_IRQ 114

/* Set by whichever entry point the target reaches first; see
 * stm32h5_mmio.h. Every part-dependent value is read through it. */
static const struct stm32h5_mmio_variant *V;

static void stm32h5_mmio_reset_impl(void);
static mm_bool stm32h5_register_mmio_impl(struct mmio_bus *bus);
static void stm32h5_flash_bind_impl(struct mm_memmap *map, mm_u8 *flash, mm_u32 flash_size,
                                    const struct mm_flash_persist *persist, mm_u32 flags);
static void stm32h5_otp_init_impl(const char *target_name);

#define mpcbb_words (V->mpcbb_words)

/* GPDMA identity and channel wiring. Applied from both the reset path and
 * the registration path: registration runs after mm_target_soc_reset(),
 * so anything it clears has to be re-established here. */
static void gpdma_configure_and_reset(void)
{
    gpdma1.instance = 0;
    gpdma1.num_channels = V->gpdma_channels;
    gpdma1.irq_base = 27; /* GPDMA1 channel IRQs start at 27 */
    gpdma1.irq_map = V->gpdma1_irq_map;
    stm32_gpdma_reset(&gpdma1);
    gpdma2.instance = 1;
    gpdma2.num_channels = V->gpdma_channels;
    gpdma2.irq_base = 90; /* GPDMA2 channel IRQs start at 90 */
    gpdma2.irq_map = V->gpdma2_irq_map;
    stm32_gpdma_reset(&gpdma2);
}

static mm_u32 stm32h5_gpio_bank_read(void *opaque, int bank);
static mm_u32 stm32h5_gpio_bank_read_moder(void *opaque, int bank);
static mm_bool stm32h5_gpio_bank_clock(void *opaque, int bank);
static mm_u32 stm32h5_gpio_bank_read_seccfgr(void *opaque, int bank);
static void exti_gpio_update(int bank, mm_u32 old_level, mm_u32 new_level);
static mm_bool stm32h5_gpio_clock_enabled_cb(int bank);
static void exti_gpio_update_cb(int bank, mm_u32 old_level, mm_u32 new_level);
static mm_bool hash_requires_secure(const struct simple_blk *tzsc);
static mm_bool aes_requires_secure(const struct simple_blk *tzsc, mm_bool is_saes);
static mm_bool pka_requires_secure(const struct simple_blk *tzsc);

static void ucpd_update_attach(struct ucpd_state *u)
{
    if (u == 0) {
        return;
    }
    if ((u->cfgr1 & UCPD_CFGR1_UCPDEN) == 0u) {
        return;
    }
    if ((u->cr & (UCPD_CR_ANAMODE | UCPD_CR_CCENABLE_BOTH)) != (UCPD_CR_ANAMODE | UCPD_CR_CCENABLE_BOTH)) {
        return;
    }
    if ((u->sr & (UCPD_SR_TYPECEVT1 | UCPD_SR_TYPECEVT2)) == 0u) {
        u->sr |= UCPD_SR_TYPECEVT1;
    }
    u->sr &= ~(UCPD_SR_TYPEC_VSTATE_CC_Msk | UCPD_SR_TYPEC_VSTATE_CC2_Msk);
    u->sr |= (3u << UCPD_SR_TYPEC_VSTATE_CC1_Pos);
}

static mm_bool ucpd_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct ucpd_state *u = (struct ucpd_state *)opaque;
    mm_u32 value = 0;
    if (u == 0 || value_out == 0) {
        return MM_FALSE;
    }
    if (size_bytes != 4u) {
        return MM_FALSE;
    }
    ucpd_update_attach(u);
    switch (offset) {
    case UCPD_CFGR1:
        value = u->cfgr1;
        break;
    case UCPD_CR:
        value = u->cr;
        break;
    case UCPD_IMR:
        value = u->imr;
        break;
    case UCPD_SR:
        value = u->sr;
        break;
    default:
        value = 0;
        break;
    }
    *value_out = value;
    return MM_TRUE;
}

static mm_bool ucpd_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct ucpd_state *u = (struct ucpd_state *)opaque;
    if (u == 0) {
        return MM_FALSE;
    }
    if (size_bytes != 4u) {
        return MM_FALSE;
    }
    switch (offset) {
    case UCPD_CFGR1:
        u->cfgr1 = value;
        ucpd_update_attach(u);
        return MM_TRUE;
    case UCPD_CR:
        u->cr = value;
        ucpd_update_attach(u);
        return MM_TRUE;
    case UCPD_IMR:
        u->imr = value;
        return MM_TRUE;
    case UCPD_ICR:
        if ((value & UCPD_ICR_TYPECEVT1CF) != 0u) {
            u->sr &= ~UCPD_SR_TYPECEVT1;
        }
        if ((value & UCPD_ICR_TYPECEVT2CF) != 0u) {
            u->sr &= ~UCPD_SR_TYPECEVT2;
        }
        return MM_TRUE;
    default:
        return MM_TRUE;
    }
}

static mm_bool hash_clock_enabled(const struct rcc_state *rcc)
{
    return ((rcc->regs[0x8c / 4u] >> 17) & 1u) != 0u;
}

static mm_bool aes_clock_enabled(const struct rcc_state *rcc, mm_bool is_saes)
{
    mm_u32 bit = is_saes ? 20u : 16u;
    return ((rcc->regs[0x8c / 4u] >> bit) & 1u) != 0u;
}

static mm_bool pka_clock_enabled(const struct rcc_state *rcc)
{
    return ((rcc->regs[0x8c / 4u] >> 19) & 1u) != 0u;
}



static mm_bool flash_trace_enabled(void)
{
    static mm_bool init = MM_FALSE;
    static mm_bool enabled = MM_FALSE;
    if (!init) {
        const char *env = getenv("M33MU_FLASH_TRACE");
        enabled = (env != 0 && env[0] != '\0') ? MM_TRUE : MM_FALSE;
        init = MM_TRUE;
    }
    return enabled;
}

static mm_bool stm32h5_rcc_clock_list_line(void *opaque, int line, char *out, size_t out_len);

static mm_bool stm32h5_gpio_bank_info(void *opaque, int bank, char *name_out, size_t name_len, int *pins_out)
{
    (void)opaque;
    if (bank < 0 || bank >= V->gpio_count) {
        return MM_FALSE;
    }
    if (name_out != 0 && name_len > 0u) {
        name_out[0] = (char)('A' + bank);
        if (name_len > 1u) {
            name_out[1] = '\0';
        }
    }
    if (pins_out != 0) {
        *pins_out = 16;
    }
    return MM_TRUE;
}

static void stm32h5_mmio_reset_impl(void)
{
    size_t i;
    mm_u32 optsr_swap = flash_ctl.regs[FLASH_OPTSR_CUR / 4u] & FLASH_OPTSR_SWAP_BANK;
    mm_bool dualbank = flash_ctl.dualbank_enabled;
    /* SECWM is an option byte: preserve it across the reset, but only once
     * the model has been bound to a flash -- before that there is nothing
     * programmed and the reset values apply. */
    mm_bool secwm_valid = (flash_ctl.flash_size != 0u) ? MM_TRUE : MM_FALSE;
    mm_u32 secwm_saved[2];
    memset(&rcc, 0, sizeof(rcc));
    memset(&rcc_s, 0, sizeof(rcc_s));
    memset(&pwr, 0, sizeof(pwr));
    memset(&tzsc_s, 0, sizeof(tzsc_s));
    memset(&tzsc_ns, 0, sizeof(tzsc_ns));
    memset(&tzic_s, 0, sizeof(tzic_s));
    memset(&tzic_ns, 0, sizeof(tzic_ns));
    memset(&sbs, 0, sizeof(sbs));
    memset(&sbs_sec, 0, sizeof(sbs_sec));
    memset(&tamp, 0, sizeof(tamp));
    memset(&bsec, 0, sizeof(bsec));
    memset(&ucpd1, 0, sizeof(ucpd1));
    memset(&ucpd1_sec, 0, sizeof(ucpd1_sec));
    memset(&ucpd1_state, 0, sizeof(ucpd1_state));
    memset(&ucpd1_state_sec, 0, sizeof(ucpd1_state_sec));
    memset(&crs, 0, sizeof(crs));
    memset(&crs_sec, 0, sizeof(crs_sec));
    memset(&dbgmcu, 0, sizeof(dbgmcu));
    memset(&icache, 0, sizeof(icache));
    memset(&dcache, 0, sizeof(dcache));
    memset(&rng, 0, sizeof(rng));
    memset(&hash_accel, 0, sizeof(hash_accel));
    memset(&aes_accel, 0, sizeof(aes_accel));
    memset(&saes_accel, 0, sizeof(saes_accel));
    memset(&pka_accel, 0, sizeof(pka_accel));
    memset(&exti, 0, sizeof(exti));
    memset(&iwdg, 0, sizeof(iwdg));
    memset(&wwdg, 0, sizeof(wwdg));
    flash_secwm_save(&flash_ctl, secwm_saved);
    memset(&flash_ctl, 0, sizeof(flash_ctl));
    flash_ctl.dualbank_enabled = dualbank;
    flash_ctl.swap_active = (optsr_swap != 0u) ? MM_TRUE : MM_FALSE;
    flash_ctl.regs[FLASH_OPTSR_CUR / 4u] =
        FLASH_OPTSR_PRODUCT_STATE_OPEN | optsr_swap;
    flash_ctl.regs[FLASH_OPTSR_PRG / 4u] =
        FLASH_OPTSR_PRODUCT_STATE_OPEN | optsr_swap;
    flash_init_secwm_defaults(&flash_ctl);
    if (secwm_valid) {
        flash_secwm_restore(&flash_ctl, secwm_saved);
    }
    mpcbb_init_defaults();
    /* Initialize GPDMA with shared implementation */
    gpdma_configure_and_reset();
    /* Initialize GPIO with shared implementation */
    for (i = 0; i < sizeof(gpio) / sizeof(gpio[0]); ++i) {
        stm32_gpio_reset(&gpio[i], (int)i);
        gpio_ctx_data[i * 2].gpio = &gpio[i];
        gpio_ctx_data[i * 2].is_secure_alias = MM_FALSE;
        gpio_ctx_data[i * 2].bank_index = (int)i;
        gpio_ctx_data[i * 2].clock_enabled = stm32h5_gpio_clock_enabled_cb;
        gpio_ctx_data[i * 2].exti_update = exti_gpio_update_cb;
        gpio_ctx_data[i * 2 + 1].gpio = &gpio[i];
        gpio_ctx_data[i * 2 + 1].is_secure_alias = MM_TRUE;
        gpio_ctx_data[i * 2 + 1].bank_index = (int)i;
        gpio_ctx_data[i * 2 + 1].clock_enabled = stm32h5_gpio_clock_enabled_cb;
        gpio_ctx_data[i * 2 + 1].exti_update = exti_gpio_update_cb;
    }
    if (V->usb_reset != 0) {
        V->usb_reset();
    }
    stm32h5_i2c_reset();
    mm_gpio_bank_set_reader(stm32h5_gpio_bank_read, 0);
    mm_gpio_bank_set_moder_reader(stm32h5_gpio_bank_read_moder, 0);
    mm_gpio_bank_set_clock_reader(stm32h5_gpio_bank_clock, 0);
    mm_gpio_bank_set_seccfgr_reader(stm32h5_gpio_bank_read_seccfgr, 0);
    mm_gpio_set_bank_info_reader(stm32h5_gpio_bank_info, 0);
    mm_rcc_set_clock_list_reader(stm32h5_rcc_clock_list_line, 0);
    /* Enable HSI by default. Model the H5 reset divider as HSIDIV=/2. */
    rcc.regs[RCC_CR / 4u] |= 1u | (1u << 3);
    /* RCC_AHB2ENR reset value (see STM32H5F4 SVD): SRAM2..5 clocks on. */
    rcc.regs[0x8c / 4u] = V->ahb2enr_reset;
    rcc_update_ready(&rcc);
    rcc_update_sysclk(&rcc);
    rcc_s = rcc;
    iwdg.regs[IWDG_RLR / 4u] = 0x00000FFFu;
    iwdg.regs[IWDG_WINR / 4u] = 0x00000FFFu;
    wwdg.regs[WWDG_CR / 4u] = 0x0000007Fu;
    wwdg.regs[WWDG_CFR / 4u] = 0x0000007Fu;
    wwdg.counter = 0x7Fu;
    exti.regs[EXTI_IMR1 / 4u] = 0xFFFE0000u;
    bsec.regs[BSEC_UID0_OFFSET / 4u] = BSEC_UID0_VALUE;
    bsec.regs[BSEC_UID1_OFFSET / 4u] = BSEC_UID1_VALUE;
    bsec.regs[BSEC_UID2_OFFSET / 4u] = BSEC_UID2_VALUE;
    uid.regs[UID0_OFFSET / 4u] = UID0_VALUE;
    uid.regs[UID1_OFFSET / 4u] = UID1_VALUE;
    uid.regs[UID2_OFFSET / 4u] = UID2_VALUE;
    /* Power ready flags. */
    pwr_update_vos(&pwr);

    /* RNG reset values */
    rng.regs[RNG_CR_OFFSET / 4] = V->rng_cr_reset;
    rng.regs[RNG_HTCR_OFFSET / 4] = 0x000072acu;
    if (V->rng_has_htcr123) {
        rng.regs[RNG_HTCR1_OFFSET / 4] = 0x0000ffffu;
        rng.regs[RNG_HTCR2_OFFSET / 4] = 0x0000ffffu;
        rng.regs[RNG_HTCR3_OFFSET / 4] = 0x0000ffffu;
    }
    hash_reset_state(&hash_accel, MM_TRUE);
    mm_pka_reset(&pka_accel);

    /* OTFDEC reset */
    if (otfdec_state == 0) {
        otfdec_state = mm_otfdec_new();
    }
    if (otfdec_state != 0) {
        mm_otfdec_reset(otfdec_state);
    }
    mm_spiflash_set_decrypt_hook(mm_otfdec_decrypt_block, otfdec_state);

    /* FLASH reset values */
    flash_ctl.regs[FLASH_ACR / 4] = 0x00000013u;
    flash_ctl.regs[FLASH_NSCR / 4] = 0x00000001u;
    flash_ctl.regs[FLASH_SECCR / 4] = 0x00000001u;
    if ((mm_otp_flags(&otp_state) & MM_OTP_FLAG_FINAL_LOCK) != 0u) {
        flash_ctl.regs[FLASH_OTPBLR_CUR / 4u] = 0xFFFFFFFFu;
    }
    flash_sync_option_regs(&flash_ctl);
}

mm_u32 *stm32h5_tzsc_regs(void)
{
    return tzsc_s.regs;
}

static mm_bool tzsc_bit_is_secure(mm_u32 offset, mm_u32 bit)
{
    return ((tzsc_s.regs[offset / 4u] >> bit) & 1u) != 0u;
}

mm_bool stm32h5_tz_attr_for_addr(mm_u32 addr,
                                      enum mm_sau_attr *attr_out,
                                      mm_u32 *region_out)
{
    mm_bool secure = MM_FALSE;

    if (attr_out == 0 || V == 0 || !V->has_tz_attr) {
        return MM_FALSE;
    }
    if (region_out != 0) {
        *region_out = 0u;
    }

    if (addr >= 0x50000000u && addr < 0x60000000u) {
        *attr_out = MM_SAU_SECURE;
        return MM_TRUE;
    }

    if (addr >= 0x40013800u && addr < 0x40013C00u) {
        secure = tzsc_bit_is_secure(0x14u, 11u); /* USART1SEC */
    } else if (addr >= 0x40004400u && addr < 0x40004800u) {
        secure = tzsc_bit_is_secure(0x10u, 13u); /* USART2SEC */
    } else if (addr >= 0x40004800u && addr < 0x40004C00u) {
        secure = tzsc_bit_is_secure(0x10u, 14u); /* USART3SEC */
    } else {
        return MM_FALSE;
    }

    *attr_out = secure ? MM_SAU_SECURE : MM_SAU_NONSECURE;
    return MM_TRUE;
}

mm_bool stm32h5_mpcbb_block_secure(int bank, mm_u32 block_index)
{
    mm_u32 word;
    mm_u32 bit;
    mm_u32 val;
    mm_bool sec;
    if (bank < 0 || bank >= (int)V->mpcbb_count) {
        return MM_FALSE;
    }
    word = block_index / 32u;
    if (word >= mpcbb_words[bank]) {
        return MM_FALSE;
    }
    bit = block_index % 32u;
    val = mpcbb[bank].regs[(MPCBB_SECCFGR_OFFSET / 4u) + word];
    sec = ((val >> bit) & 1u) != 0u;
    if ((mpcbb[bank].regs[MPCBB_CR_OFFSET / 4u] & MPCBB_CR_INVSECSTATE) != 0u) {
        sec = !sec;
    }
    return sec;
}

static mm_bool gpio_clock_enabled(const struct rcc_state *rcc, int index)
{
    /* AHB2ENR offset 0x8C: GPIOAEN bit0..GPIOJEN bit9 are contiguous, but
     * GPIOKEN sits at bit 26 (RM0517 Section 11.8.27). */
    mm_u32 ahb2enr = rcc->regs[0x8c / 4];
    mm_u32 bit;
    if (index < 0 || index > 10) {
        return MM_FALSE;
    }
    bit = (index == 10) ? 26u : (mm_u32)index;
    return ((ahb2enr >> bit) & 1u) != 0u;
}

static mm_bool stm32h5_gpio_clock_enabled_cb(int bank)
{
    return gpio_clock_enabled(&rcc, bank) || gpio_clock_enabled(rcc_sec, bank);
}

static void exti_gpio_update_cb(int bank, mm_u32 old_level, mm_u32 new_level)
{
    exti_gpio_update(bank, old_level, new_level);
    mm_spi_bus_poll_all();
}

