danielinux/m33mu/cpu/stm32h5_mmio.c
enum rcc_bus_kind {
    RCC_BUS_AHB1 = 0,
    RCC_BUS_AHB2 = 1,
    RCC_BUS_APB1L = 2,
    RCC_BUS_APB1H = 3,
    RCC_BUS_APB2 = 4,
    RCC_BUS_APB3 = 5
};

struct rcc_clk_name {
    const char *name;
    enum rcc_bus_kind bus;
    mm_u32 bit;
};

static const struct rcc_clk_name rcc_clk_names[] = {
    { "ETH", RCC_BUS_AHB1, 19u },
    { "ETHTX", RCC_BUS_AHB1, 20u },
    { "ETHRX", RCC_BUS_AHB1, 21u },
    { "GPIOA", RCC_BUS_AHB2, 0u },
    { "GPIOB", RCC_BUS_AHB2, 1u },
    { "GPIOC", RCC_BUS_AHB2, 2u },
    { "GPIOD", RCC_BUS_AHB2, 3u },
    { "GPIOE", RCC_BUS_AHB2, 4u },
    { "GPIOF", RCC_BUS_AHB2, 5u },
    { "GPIOG", RCC_BUS_AHB2, 6u },
    { "GPIOH", RCC_BUS_AHB2, 7u },
    { "GPIOI", RCC_BUS_AHB2, 8u },
    { "GPIOJ", RCC_BUS_AHB2, 9u },
    { "GPIOK", RCC_BUS_AHB2, 26u },
    { "RNG", RCC_BUS_AHB2, 18u },
    { "PKA", RCC_BUS_AHB2, 19u },
    { "TIM2", RCC_BUS_APB1L, 0u },
    { "TIM3", RCC_BUS_APB1L, 1u },
    { "TIM4", RCC_BUS_APB1L, 2u },
    { "TIM5", RCC_BUS_APB1L, 3u },
    { "USART2", RCC_BUS_APB1L, 17u },
    { "USART3", RCC_BUS_APB1L, 18u },
    { "UART4", RCC_BUS_APB1L, 19u },
    { "UART5", RCC_BUS_APB1L, 20u },
    { "USART6", RCC_BUS_APB1L, 25u },
    { "UART7", RCC_BUS_APB1L, 30u },
    { "UART8", RCC_BUS_APB1L, 31u },
    { "UART9", RCC_BUS_APB1H, 0u },
    { "UART12", RCC_BUS_APB1H, 1u },
    { "USART1", RCC_BUS_APB2, 14u }
};

static mm_u32 rcc_bus_reg(const struct rcc_state *r, enum rcc_bus_kind bus)
{
    if (r == 0) {
        return 0u;
    }
    switch (bus) {
    case RCC_BUS_AHB1:
        return r->regs[0x88 / 4];
    case RCC_BUS_AHB2:
        return r->regs[0x8c / 4];
    case RCC_BUS_APB1L:
        return r->regs[0x9c / 4];
    case RCC_BUS_APB1H:
        return r->regs[0xa0 / 4];
    case RCC_BUS_APB2:
        return r->regs[0xa4 / 4];
    case RCC_BUS_APB3:
        return r->regs[0xa8 / 4];
    default:
        return 0u;
    }
}

static const char *rcc_bus_name(enum rcc_bus_kind bus)
{
    switch (bus) {
    case RCC_BUS_AHB1: return "AHB1";
    case RCC_BUS_AHB2: return "AHB2";
    case RCC_BUS_APB1L: return "APB1L";
    case RCC_BUS_APB1H: return "APB1H";
    case RCC_BUS_APB2: return "APB2";
    case RCC_BUS_APB3: return "APB3";
    default: return "RCC";
    }
}

static mm_bool stm32h5_rcc_clock_list_line(void *opaque, int line, char *out, size_t out_len)
{
    enum rcc_bus_kind bus;
    int line_idx = 0;
    size_t i;
    (void)opaque;
    if (out == 0 || out_len == 0u) {
        return MM_FALSE;
    }
    for (bus = RCC_BUS_AHB1; bus <= RCC_BUS_APB3; ++bus) {
        mm_u32 reg = rcc_bus_reg(&rcc, bus);
        char buf[256];
        size_t pos = 0;
        mm_bool have = MM_FALSE;
        if (reg == 0u) {
            continue;
        }
        pos += snprintf(buf + pos, sizeof(buf) - pos, "%s:", rcc_bus_name(bus));
        for (i = 0; i < sizeof(rcc_clk_names) / sizeof(rcc_clk_names[0]); ++i) {
            if (rcc_clk_names[i].bus != bus) {
                continue;
            }
            /* The GPIO entries run GPIOA.. in order; hide the banks this
             * part does not carry. */
            if (rcc_clk_names[i].name[0] == 'G' && rcc_clk_names[i].name[1] == 'P' &&
                (int)(rcc_clk_names[i].name[4] - 'A') >= V->gpio_count) {
                continue;
            }
            if ((reg & (1u << rcc_clk_names[i].bit)) == 0u) {
                continue;
            }
            if (pos + 2u < sizeof(buf)) {
                pos += snprintf(buf + pos, sizeof(buf) - pos, " %s", rcc_clk_names[i].name);
                have = MM_TRUE;
            }
        }
        if (!have) {
            continue;
        }
        if (line_idx == line) {
            snprintf(out, out_len, "%s", buf);
            return MM_TRUE;
        }
        line_idx++;
    }
    return MM_FALSE;
}

static mm_u32 stm32h5_gpio_bank_read(void *opaque, int bank)
{
    (void)opaque;
    if (bank < 0 || bank >= (int)(sizeof(gpio) / sizeof(gpio[0]))) {
        return 0u;
    }
    return gpio[bank].regs[0x14u / 4];
}

static mm_u32 stm32h5_gpio_bank_read_moder(void *opaque, int bank)
{
    (void)opaque;
    if (bank < 0 || bank >= (int)(sizeof(gpio) / sizeof(gpio[0]))) {
        return 0u;
    }
    return gpio[bank].regs[0x00u / 4];
}

static mm_bool stm32h5_gpio_bank_clock(void *opaque, int bank)
{
    (void)opaque;
    return gpio_clock_enabled(&rcc, bank);
}

static mm_u32 stm32h5_gpio_bank_read_seccfgr(void *opaque, int bank)
{
    (void)opaque;
    if (bank < 0 || bank >= (int)(sizeof(gpio) / sizeof(gpio[0]))) {
        return 0u;
    }
    return gpio[bank].regs[0x30u / 4];
}

static mm_bool rng_clock_enabled(const struct rcc_state *rcc)
{
    /* RCC_AHB2ENR offset 0x8C, RNGEN bit18 */
    mm_u32 ahb2enr = rcc->regs[0x8c / 4];
    return ((ahb2enr >> 18) & 1u) != 0u;
}

static mm_bool rng_clock_on_any(void)
{
    /* The RNG clock enable is shared hardware state: the secure and
     * non-secure RCC views both act on the same clock, so honor the
     * enable written through either alias. */
    return rng_clock_enabled(&rcc) || rng_clock_enabled(rcc_sec);
}

static mm_bool rng_requires_secure(const struct simple_blk *tzsc)
{
    /* GTZC1_TZSC_SECCFGR3 offset 0x18, RNGSEC bit18 */
    mm_u32 seccfgr3 = tzsc->regs[TZSC_SECCFGR3_OFFSET / 4u];
    return ((seccfgr3 >> TZSC_RNGSEC_BIT) & 1u) != 0u;
}

static mm_bool tzsc_requires_secure(const struct simple_blk *tzsc, mm_u32 bit)
{
    mm_u32 seccfgr3;
    if (bit >= 32u) {
        return MM_FALSE;
    }
    seccfgr3 = tzsc->regs[TZSC_SECCFGR3_OFFSET / 4u];
    return ((seccfgr3 >> bit) & 1u) != 0u;
}

static mm_bool hash_requires_secure(const struct simple_blk *tzsc)
{
    return tzsc_requires_secure(tzsc, TZSC_HASHSEC_BIT);
}

static mm_bool aes_requires_secure(const struct simple_blk *tzsc, mm_bool is_saes)
{
    return tzsc_requires_secure(tzsc, is_saes ? TZSC_SAESSEC_BIT : TZSC_AESSEC_BIT);
}

static mm_bool pka_requires_secure(const struct simple_blk *tzsc)
{
    return tzsc_requires_secure(tzsc, TZSC_PKASEC_BIT);
}

static void rng_fill(struct rng_state *r)
{
    mm_u32 v = mm_host_rng_u32();

