danielinux/m33mu/cpu/stm32h5_mmio.c
    r->dr = v;
    r->dr_valid = MM_TRUE;
    r->regs[RNG_SR_OFFSET / 4] |= 1u;
    if (g_rng_nvic != 0 && (r->regs[RNG_CR_OFFSET / 4] & (1u << 3)) != 0u) {
        mm_nvic_set_pending(g_rng_nvic, (mm_u32)RNG_IRQ, MM_TRUE);
    }
}

static mm_u32 flash_bank_count(const struct flash_state *f)
{
    if (f == 0) {
        return 1u;
    }
    return f->dualbank_enabled ? FLASH_BANK_COUNT : 1u;
}

static void flash_apply_bank_swap(struct flash_state *f)
{
    mm_u32 bank_size;
    mm_u32 i;
    if (f == 0 || f->flash == 0 || f->flash_size == 0u) {
        return;
    }
    if ((f->flash_size % 2u) != 0u) {
        return;
    }
    bank_size = f->flash_size / 2u;
    for (i = 0; i < bank_size; ++i) {
        mm_u8 tmp = f->flash[i];
        f->flash[i] = f->flash[i + bank_size];
        f->flash[i + bank_size] = tmp;
    }
    if (f->persist != 0 && f->persist->enabled) {
        mm_flash_persist_flush((struct mm_flash_persist *)f->persist, 0u, f->flash_size);
    }
}

static void flash_set_swap_state(struct flash_state *f, mm_bool swap_active)
{
    if (f == 0) {
        return;
    }
    if (!f->dualbank_enabled) {
        if (f->swap_active) {
            flash_apply_bank_swap(f);
        }
        f->swap_active = MM_FALSE;
        return;
    }
    if (f->swap_active == swap_active) {
        return;
    }
    f->swap_active = swap_active;
    flash_apply_bank_swap(f);
}

static void flash_sync_option_regs(struct flash_state *f)
{
    mm_u32 swap_bit;
    if (f == 0) {
        return;
    }
    if (!f->dualbank_enabled) {
        f->swap_active = MM_FALSE;
    }
    swap_bit = f->swap_active ? FLASH_OPTSR_SWAP_BANK : 0u;
    f->regs[FLASH_OPTSR_CUR / 4u] = (f->regs[FLASH_OPTSR_CUR / 4u] & ~FLASH_OPTSR_SWAP_BANK) | swap_bit;
    f->regs[FLASH_OPTSR_PRG / 4u] = (f->regs[FLASH_OPTSR_PRG / 4u] & ~FLASH_OPTSR_SWAP_BANK) | swap_bit;
}

static mm_u32 flash_sector_size(void)
{
    /* FLASH_SECTOR_COUNT is the total sector count over the whole flash:
     * sectors are 8 Kbytes on STM32H5 (RM0517, 256 sectors per bank), so
     * the bank count does not enter the division. */
    return (FLASH_SECTOR_COUNT == 0u) ? 0u
        : (flash_ctl.flash_size / FLASH_SECTOR_COUNT);
}

/*
 * Provisioned watermarks, i.e. the SECWM option bytes.  Set from the command
 * line before the first reset, and thereafter carried across resets by
 * flash_secwm_save()/flash_secwm_restore(): option bytes are non-volatile, so
 * a watermark programmed through the _PRG registers has to survive the system
 * reset that applies it, exactly like SWAP_BANK.
 */
static mm_u32 g_secwm_prov[2];
static mm_bool g_secwm_prov_valid[2];

/* True once any bank has been provisioned from the command line. */
static mm_bool flash_secwm_provisioned(void)
{
    return (g_secwm_prov_valid[0] || g_secwm_prov_valid[1]) ? MM_TRUE : MM_FALSE;
}

/*
 * Watermark a bank carries when --secwm did not name it.
 *
 * The whole bank secure. This is the permissive choice, and it is only ever
 * consulted in a session that provisioned the *other* bank: a session that
 * provisioned neither does not consult the watermark at all, see
 * flash_sector_secure_cb.
 */
static mm_u32 flash_secwm_reset_value(mm_bool phys_hi)
{
    mm_u32 sectors_per_bank;

    (void)phys_hi;
    if (FLASH_BANK_COUNT == 0u) {
        return FLASH_SECWM_EMPTY;
    }
    sectors_per_bank = FLASH_SECTOR_COUNT / FLASH_BANK_COUNT;
    if (sectors_per_bank == 0u) {
        return FLASH_SECWM_EMPTY;
    }
    /* STRT = 0, END = last sector of the bank. */
    return ((sectors_per_bank - 1u) & FLASH_SECWM_STRT_MASK)
        << FLASH_SECWM_END_SHIFT;
}

void stm32h5_flash_set_secwm(int bank, mm_u32 strt, mm_u32 end)
{
    if (bank < 0 || bank > 1) {
        return;
    }
    g_secwm_prov[bank] = (strt & 0xFFFFu) |
        ((end & 0xFFFFu) << FLASH_SECWM_END_SHIFT);
    g_secwm_prov_valid[bank] = MM_TRUE;
}

static void flash_init_secwm_defaults(struct flash_state *f)
{
    static const mm_u32 cur_off[2] = { FLASH_SECWM1R_CUR, FLASH_SECWM2R_CUR };
    static const mm_u32 prg_off[2] = { FLASH_SECWM1R_PRG, FLASH_SECWM2R_PRG };
    mm_u32 i;

    for (i = 0; i < 2u; i++) {
        mm_u32 v = g_secwm_prov_valid[i] ? g_secwm_prov[i]
                                         : flash_secwm_reset_value(i != 0u);
        f->regs[cur_off[i] / 4u] = v;
        f->regs[prg_off[i] / 4u] = v;
    }
}

/*
 * Recompute the fallback watermark once the flash geometry is known, and say
 * so.  Banks named by --secwm1/--secwm2 are provisioned and left alone.
 */
static void flash_apply_secwm_fallback(struct flash_state *f)
{
    static mm_bool announced = MM_FALSE;
    mm_u32 v1;
    mm_u32 v2;

    if (f->flash_size == 0u) {
        return;
    }
    if (!g_secwm_prov_valid[0]) {
        v1 = flash_secwm_reset_value(MM_FALSE);
        f->regs[FLASH_SECWM1R_CUR / 4u] = v1;
        f->regs[FLASH_SECWM1R_PRG / 4u] = v1;
    }
    if (!g_secwm_prov_valid[1]) {
        v2 = flash_secwm_reset_value(MM_TRUE);
        f->regs[FLASH_SECWM2R_CUR / 4u] = v2;
        f->regs[FLASH_SECWM2R_PRG / 4u] = v2;
    }
    if (announced) {
        return;
    }
    announced = MM_TRUE;
    if (!flash_secwm_provisioned()) {
        printf("[FLASH] SECWM not provisioned; flash TZ filter inert. "
               "Pass --secwm1/--secwm2 to model a provisioned part.\n");
    } else {
        printf("[FLASH] SECWM1=0x%08lx SECWM2=0x%08lx\n",
               (unsigned long)f->regs[FLASH_SECWM1R_CUR / 4u],
               (unsigned long)f->regs[FLASH_SECWM2R_CUR / 4u]);
    }
}

/* Option bytes survive a system reset: capture and reapply the watermark
 * around the memset that models the reset of the volatile controller state. */
static void flash_secwm_save(const struct flash_state *f, mm_u32 out[2])
{
    out[0] = f->regs[FLASH_SECWM1R_CUR / 4u];
    out[1] = f->regs[FLASH_SECWM2R_CUR / 4u];
}

static void flash_secwm_restore(struct flash_state *f, const mm_u32 in[2])
{
    f->regs[FLASH_SECWM1R_CUR / 4u] = in[0];
    f->regs[FLASH_SECWM1R_PRG / 4u] = in[0];
    f->regs[FLASH_SECWM2R_CUR / 4u] = in[1];
    f->regs[FLASH_SECWM2R_PRG / 4u] = in[1];
}

static mm_bool flash_sector_attr_secure(struct flash_state *f, mm_u32 offset)
{
    mm_u32 sector_size = flash_sector_size();
    mm_u32 bank_size;
    mm_u32 sector;
    mm_bool phys_hi;
    mm_u32 secwm;
    mm_u32 strt;
    mm_u32 end;
    mm_u32 bb_base;

    if (f == 0 || f->flash_size == 0u || sector_size == 0u ||
            FLASH_BANK_COUNT < 2u) {
        return MM_FALSE;
    }
    bank_size = f->flash_size / FLASH_BANK_COUNT;
    if (bank_size == 0u || offset >= f->flash_size) {
        return MM_FALSE;
    }
    /* The backing array holds the logical (post-swap) view; SECWM/SECBB
     * refer to physical banks. */
    phys_hi = (offset >= bank_size) ? MM_TRUE : MM_FALSE;
    if (f->swap_active) {
        phys_hi = phys_hi ? MM_FALSE : MM_TRUE;
    }
    sector = (offset % bank_size) / sector_size;

    secwm = f->regs[(phys_hi ? FLASH_SECWM2R_CUR : FLASH_SECWM1R_CUR) / 4u];
    strt = secwm & FLASH_SECWM_STRT_MASK;
    end = (secwm >> FLASH_SECWM_END_SHIFT) & FLASH_SECWM_STRT_MASK;
    if (sector >= strt && sector <= end) {
        return MM_TRUE;
    }

    bb_base = phys_hi ? FLASH_SECBB2R : FLASH_SECBB1R;
    if ((sector / 32u) < FLASH_SECBB_NREGS) {
        mm_u32 reg = f->regs[(bb_base + 4u * (sector / 32u)) / 4u];
        if ((reg >> (sector % 32u)) & 1u) {
            return MM_TRUE;
        }
    }
    return MM_FALSE;
}

