danielinux/m33mu/cpu/stm32h5_mmio.c
/*
 * Sector attribution as the flash TZ filter sees it.
 *
 * There is no "unprovisioned, therefore unfiltered" state: on silicon a
 * sector outside every watermark and with no SECBB bit is simply non-secure,
 * and a secure access to it reads back zero.  Measured on NUCLEO-H563ZI with
 * SECWM1 = sectors 0..15 and SECBB clear -- sector 20 read 0 through the
 * secure alias and its marker word through the non-secure one.  The emulated
 * part therefore resets with a real watermark (flash_secwm_reset_value) the
 * way a TZEN=1 device does, rather than with an empty one that has to be
 * special-cased.
 *
 * UNFILTERED survives for two cases.  One is a session with TrustZone disabled
 * (--no-tz, or a non-secure image detected at boot), where the part behaves as
 * TZEN=0 and the filter does not exist.
 *
 * The other is a session that did not provision a watermark.  Modelling the
 * filter needs to know which sectors are secure, and that is a property of the
 * board's option bytes, not of the image: the dual-bank firmware here wants all
 * of bank 1 secure, while a bootloader handing off to an application wants the
 * application's sectors non-secure.  No single guess serves both, and guessing
 * wrong breaks the run in a way that looks nothing like a watermark problem.
 * So an unprovisioned session keeps the pre-filter behaviour and says so, and
 * --secwm1/--secwm2 opts into the real model.
 */
static enum mm_flash_tz_attr flash_sector_secure_cb(void *opaque,
                                                    mm_u32 byte_offset)
{
    struct flash_state *f = (struct flash_state *)opaque;
    const struct mm_target_cfg *cfg;
    mm_u32 bank_size;

    if (f == 0 || f->flash_size == 0u || FLASH_BANK_COUNT < 2u ||
            byte_offset >= f->flash_size) {
        return MM_FLASH_TZ_UNFILTERED;
    }
    bank_size = f->flash_size / FLASH_BANK_COUNT;
    if (bank_size == 0u) {
        return MM_FLASH_TZ_UNFILTERED;
    }
    /* Unprovisioned: nothing to enforce, and nothing to guess. */
    if (!flash_secwm_provisioned()) {
        return MM_FLASH_TZ_UNFILTERED;
    }
    /* TZEN=0 equivalent: no security attribution to enforce. */
    cfg = mm_target_current_cfg();
    if (cfg != 0 && cfg->tz_attr_for_addr == 0) {
        return MM_FLASH_TZ_UNFILTERED;
    }
    return flash_sector_attr_secure(f, byte_offset) ? MM_FLASH_TZ_SECURE
                                                    : MM_FLASH_TZ_NONSECURE;
}

static void flash_set_busy(mm_u32 reg_offset, mm_bool busy)
{
    mm_u32 idx = reg_offset / 4u;
    if (busy) {
        flash_ctl.regs[idx] |= FLASH_FLAG_BSY;
    } else {
        flash_ctl.regs[idx] &= ~FLASH_FLAG_BSY;
    }
}

static void flash_set_eop(mm_u32 reg_offset)
{
    flash_ctl.regs[reg_offset / 4u] |= FLASH_FLAG_EOP;
}

static void flash_clear_eop(mm_u32 reg_offset)
{
    flash_ctl.regs[reg_offset / 4u] &= ~FLASH_FLAG_EOP;
}

static mm_bool flash_is_unlocked(mm_u32 reg_offset)
{
    return (flash_ctl.regs[reg_offset / 4u] & FLASH_CR_LOCK) == 0u;
}

static void flash_handle_key(mm_u32 offset, mm_u32 value)
{
    mm_u8 *stage = (offset == FLASH_NSKEYR) ? &flash_ctl.ns_key_stage : &flash_ctl.sec_key_stage;
    mm_u32 cr_off = (offset == FLASH_NSKEYR) ? FLASH_NSCR : FLASH_SECCR;
    if (*stage == 0u) {
        if (value == FLASH_KEY1) {
            *stage = 1u;
        } else {
            *stage = 0u;
        }
        return;
    }
    if (*stage == 1u) {
        if (value == FLASH_KEY2) {
            flash_ctl.regs[cr_off / 4u] &= ~FLASH_CR_LOCK;
        }
        *stage = 0u;
    }
}

static void flash_apply_erase(mm_u32 cr_off, mm_u32 sr_off)
{
    mm_u32 cr = flash_ctl.regs[cr_off / 4u];
    mm_u32 sector_size = flash_sector_size();
    mm_u32 bank_size = 0;
    mm_u32 bank_offset = 0;
    mm_u32 bank_count = flash_bank_count(&flash_ctl);
    mm_u32 start = 0;
    mm_u32 length = 0;
    mm_bool bank2;
    if (flash_ctl.flash == 0 || flash_ctl.flash_size == 0 || sector_size == 0) {
        return;
    }
    /* BKSEL always refers to the physical bank, whatever the SWAP_BANK
     * setting (RM0517), and selects the physical bank even when dualbank
     * is disabled. The backing array holds the logical (post-swap) view,
     * so the physical bank selection must be inverted while the banks are
     * swapped. */
    if (flash_ctl.flash_size != 0u) {
        if (FLASH_BANK_COUNT > 1u && flash_ctl.flash_size >= FLASH_BANK_COUNT) {
            bank_size = flash_ctl.flash_size / FLASH_BANK_COUNT;
        } else {
            bank_size = (bank_count != 0u) ? (flash_ctl.flash_size / bank_count) : 0u;
        }
    }
    bank2 = ((cr & FLASH_CR_BKSEL) != 0u) ? MM_TRUE : MM_FALSE;
    if (flash_ctl.swap_active) {
        bank2 = bank2 ? MM_FALSE : MM_TRUE;
    }
    if ((cr & FLASH_CR_BER) != 0u) {
        /* Bank erase targets the physical bank selected by BKSEL (RM0517:
         * "swap setting is ignored"). */
        if (bank_size != 0u) {
            start = bank2 ? bank_size : 0u;
            length = bank_size;
        } else {
            start = 0;
            length = flash_ctl.flash_size;
        }
    } else if ((cr & FLASH_CR_SER) != 0u) {
        mm_u32 snb = (cr & FLASH_CR_SNB_MASK) >> FLASH_CR_SNB_SHIFT;
        start = snb * sector_size;
        if (bank2 && bank_size != 0u) {
            bank_offset = bank_size;
            start += bank_offset;
        }
        if (start >= flash_ctl.flash_size) {
            return;
        }
        length = sector_size;
        if (start + length > flash_ctl.flash_size) {
            length = flash_ctl.flash_size - start;
        }
    } else {
        return;
    }
    if (flash_trace_enabled()) {
        const char *sec = (cr_off == FLASH_SECCR) ? "S" : "NS";
        const char *mode = (cr & FLASH_CR_BER) ? "BER" : "SER";
        mm_u32 snb = (cr & FLASH_CR_SNB_MASK) >> FLASH_CR_SNB_SHIFT;
        printf("[FLASH_ERASE] %s mode=%s snb=%lu start=0x%08lx len=0x%08lx\n",
               sec,
               mode,
               (unsigned long)snb,
               (unsigned long)start,
               (unsigned long)length);
    }
    flash_set_busy(sr_off, MM_TRUE);
    memset(flash_ctl.flash + start, 0xFF, length);
    flash_set_busy(sr_off, MM_FALSE);
    flash_set_eop(sr_off);
    if (flash_ctl.persist != 0 && flash_ctl.persist->enabled) {
        mm_flash_persist_flush((struct mm_flash_persist *)flash_ctl.persist, start, length);
    }
}

