danielinux/m33mu/cpu/stm32h5_mmio.c
static mm_bool flash_write_cb(void *opaque, enum mm_sec_state sec, mm_u32 addr, mm_u32 size_bytes, mm_u32 value)
{
    mm_u32 base;
    mm_u32 offset;
    mm_u32 cr_off;
    mm_u32 sr_off;
    mm_u32 i;
    mm_bool erase_mode;
    mm_bool erase_value;
    (void)opaque;

    if (flash_ctl.flash == 0 || flash_ctl.flash_size == 0) {
        return MM_FALSE;
    }
    if (addr >= flash_ctl.base_s && addr < flash_ctl.base_s + flash_ctl.flash_size) {
        base = flash_ctl.base_s;
    } else if (addr >= flash_ctl.base_ns && addr < flash_ctl.base_ns + flash_ctl.flash_size) {
        base = flash_ctl.base_ns;
    } else {
        return MM_FALSE;
    }
    offset = addr - base;
    cr_off = (sec == MM_SECURE) ? FLASH_SECCR : FLASH_NSCR;
    sr_off = (sec == MM_SECURE) ? FLASH_SECSR : FLASH_NSSR;

    if (offset + size_bytes > flash_ctl.flash_size) {
        return MM_FALSE;
    }
    if (flash_trace_enabled()) {
        printf("[FLASH_WRITE] %s addr=0x%08lx size=%lu value=0x%08lx\n",
               (sec == MM_SECURE) ? "S" : "NS",
               (unsigned long)addr,
               (unsigned long)size_bytes,
               (unsigned long)value);
    }
    if (base == flash_ctl.base_ns &&
            flash_sector_attr_secure(&flash_ctl, offset)) {
        /* NS-alias write to a secure sector: write ignored (RM0517). */
        return MM_TRUE;
    }
    if (!flash_is_unlocked(cr_off)) {
        return MM_TRUE;
    }
    if ((flash_ctl.regs[cr_off / 4u] & FLASH_CR_PG) == 0u) {
        return MM_TRUE;
    }

    erase_mode = ((flash_ctl.regs[cr_off / 4u] & FLASH_CR_SER) != 0u) ? MM_TRUE : MM_FALSE;
    erase_value = MM_FALSE;
    if (erase_mode) {
        if (size_bytes == 4u) {
            erase_value = (value == 0xFFFFFFFFu) ? MM_TRUE : MM_FALSE;
        } else if (size_bytes == 2u) {
            erase_value = ((value & 0xFFFFu) == 0xFFFFu) ? MM_TRUE : MM_FALSE;
        } else if (size_bytes == 1u) {
            erase_value = ((value & 0xFFu) == 0xFFu) ? MM_TRUE : MM_FALSE;
        }
    }

    if ((flash_ctl.flags & MM_TARGET_FLAG_NVM_WRITEONCE) != 0u && !(erase_mode && erase_value)) {
        for (i = 0; i < size_bytes; ++i) {
            if (flash_ctl.flash[offset + i] != 0xFFu) {
                flash_ctl.regs[sr_off / 4u] |= FLASH_FLAG_PGSERR;
                return MM_TRUE;
            }
        }
    }

    if (size_bytes == 4u) {
        flash_ctl.flash[offset] &= (mm_u8)(value & 0xFFu);
        flash_ctl.flash[offset + 1u] &= (mm_u8)((value >> 8) & 0xFFu);
        flash_ctl.flash[offset + 2u] &= (mm_u8)((value >> 16) & 0xFFu);
        flash_ctl.flash[offset + 3u] &= (mm_u8)((value >> 24) & 0xFFu);
    } else if (size_bytes == 2u) {
        flash_ctl.flash[offset] &= (mm_u8)(value & 0xFFu);
        flash_ctl.flash[offset + 1u] &= (mm_u8)((value >> 8) & 0xFFu);
    } else if (size_bytes == 1u) {
        flash_ctl.flash[offset] &= (mm_u8)(value & 0xFFu);
    } else {
        return MM_FALSE;
    }
    flash_set_eop(sr_off);
    if (flash_ctl.persist != 0 && flash_ctl.persist->enabled) {
        mm_flash_persist_flush((struct mm_flash_persist *)flash_ctl.persist, offset, size_bytes);
    }
    return MM_TRUE;
}

static mm_bool otp_block_locked(mm_u32 offset)
{
    mm_u32 block = offset / FLASH_OTP_BLOCK_SIZE;
    if (block >= FLASH_OTP_BLOCK_COUNT) return MM_TRUE;
    if ((flash_ctl.regs[FLASH_OTPBLR_CUR / 4u] & (1u << block)) != 0u) {
        return MM_TRUE;
    }
    return MM_FALSE;
}

static mm_bool otp_mem_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    mm_u8 buf[4];
    (void)opaque;
    if (value_out == 0 || size_bytes == 0u || size_bytes > 4u) return MM_FALSE;
    if (offset + size_bytes > FLASH_OTP_SIZE) return MM_FALSE;
    if (!mm_otp_read(&otp_state, offset, buf, size_bytes)) return MM_FALSE;
    *value_out = 0u;
    if (size_bytes >= 1u) *value_out |= buf[0];
    if (size_bytes >= 2u) *value_out |= (mm_u32)buf[1] << 8;
    if (size_bytes >= 3u) *value_out |= (mm_u32)buf[2] << 16;
    if (size_bytes >= 4u) *value_out |= (mm_u32)buf[3] << 24;
    return MM_TRUE;
}

static mm_bool otp_mem_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    mm_u8 buf[4];
    enum mm_sec_state sec = mmio_active_sec();
    mm_u32 cr_off = (sec == MM_SECURE) ? FLASH_SECCR : FLASH_NSCR;
    mm_u32 sr_off = (sec == MM_SECURE) ? FLASH_SECSR : FLASH_NSSR;
    (void)opaque;
    if (size_bytes == 0u || size_bytes > 4u) return MM_FALSE;
    if (offset + size_bytes > FLASH_OTP_SIZE) return MM_FALSE;
    if (!flash_is_unlocked(cr_off) || (flash_ctl.regs[cr_off / 4u] & FLASH_CR_PG) == 0u) {
        flash_ctl.regs[sr_off / 4u] |= FLASH_FLAG_PGSERR;
        return MM_TRUE;
    }
    if (otp_block_locked(offset)) {
        flash_ctl.regs[sr_off / 4u] |= FLASH_FLAG_PGSERR;
        return MM_TRUE;
    }
    buf[0] = (mm_u8)(value & 0xffu);
    buf[1] = (mm_u8)((value >> 8) & 0xffu);
    buf[2] = (mm_u8)((value >> 16) & 0xffu);
    buf[3] = (mm_u8)((value >> 24) & 0xffu);
    if (!mm_otp_write(&otp_state, offset, buf, size_bytes)) {
        flash_ctl.regs[sr_off / 4u] |= FLASH_FLAG_PGSERR;
        return MM_TRUE;
    }
    return MM_TRUE;
}

/* Reset bits currently unused (could clear state if asserted). */

static mm_bool rcc_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct rcc_state *r = (struct rcc_state *)opaque;
    if (value_out == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > RCC_SIZE) return MM_FALSE;
    if (offset <= RCC_CFGR1 && (offset + size_bytes) > RCC_CFGR1) {
        mm_u32 cfgr1 = r->regs[RCC_CFGR1 / 4];
        mm_u32 sw = cfgr1 & 0x7u;
        r->regs[RCC_CFGR1 / 4] = (cfgr1 & ~(0x7u << 3)) | (sw << 3);
    }
    memcpy(value_out, (mm_u8 *)r->regs + offset, size_bytes);
    return MM_TRUE;
}

static mm_u64 rcc_hsi_hz(const struct rcc_state *r)
{
    mm_u32 cr = r->regs[RCC_CR / 4u];
    mm_u32 divsel = (cr >> 3) & 0x3u;
    mm_u32 div = 1u << divsel;
    return 64000000ull / (mm_u64)div;
}

static void rcc_update_ready(struct rcc_state *r)
{
    mm_u32 cr = r->regs[RCC_CR / 4u];
    /* Mirror RDY bits to match ON bits (immediate ready). */
    /* HSIRDY bit1 follows HSION bit0 */
    if ((cr & (1u << 0)) != 0u) cr |= (1u << 1); else cr &= ~(1u << 1);
    /* HSIDIVF bit5 reflects immediate divider propagation while HSI is on. */
    if ((cr & (1u << 0)) != 0u) cr |= (1u << 5); else cr &= ~(1u << 5);
    /* CSIRDY bit9 follows CSION bit8 */
    if ((cr & (1u << 8)) != 0u) cr |= (1u << 9); else cr &= ~(1u << 9);
    /* HSI48RDY bit13 follows HSI48ON bit12 */
    if ((cr & (1u << 12)) != 0u) cr |= (1u << 13); else cr &= ~(1u << 13);
    /* HSERDY bit17 follows HSEON bit16 */
    if ((cr & (1u << 16)) != 0u) cr |= (1u << 17); else cr &= ~(1u << 17);
    /* PLL1RDY bit25 follows PLL1ON bit24 */
    if ((cr & (1u << 24)) != 0u) cr |= (1u << 25); else cr &= ~(1u << 25);
    /* PLL2RDY bit27 follows PLL2ON bit26 */
    if ((cr & (1u << 26)) != 0u) cr |= (1u << 27); else cr &= ~(1u << 27);
    /* PLL3RDY bit29 follows PLL3ON bit28 */
    if ((cr & (1u << 28)) != 0u) cr |= (1u << 29); else cr &= ~(1u << 29);
    r->regs[0] = cr;
}

