danielinux/m33mu/cpu/stm32h5_mmio.c
static void rcc_update_bdcr(struct rcc_state *r)
{
    mm_u32 bdcr = r->regs[RCC_BDCR / 4];
    if ((bdcr & (1u << 0)) != 0u) bdcr |= (1u << 1); else bdcr &= ~(1u << 1);
    if ((bdcr & (1u << 26)) != 0u) bdcr |= (1u << 27); else bdcr &= ~(1u << 27);
    r->regs[RCC_BDCR / 4] = bdcr;
}

static mm_u64 rcc_pll1_p_clk(const struct rcc_state *r)
{
    mm_u32 pllcfgr = r->regs[RCC_PLL1CFGR / 4];
    mm_u32 plldivr = r->regs[RCC_PLL1DIVR / 4];
    mm_u32 src = pllcfgr & 0x3u;
    mm_u64 fin = 0;
    mm_u32 divm = (pllcfgr >> 8) & 0x3fu;
    mm_u32 n = (plldivr & 0x1ffu) + 1u;
    mm_u32 p = ((plldivr >> 9) & 0x7fu) + 1u;

    if (src == 1u) fin = rcc_hsi_hz(r); /* HSI */
    else if (src == 2u) fin = 4000000ull; /* CSI */
    else if (src == 3u) fin = 8000000ull; /* HSE */
    else fin = 0;

    if (fin == 0 || divm == 0u || p == 0u) {
        return 0;
    }
    return (fin / (mm_u64)divm) * (mm_u64)n / (mm_u64)p;
}

static void rcc_update_sysclk(struct rcc_state *r)
{
    mm_u32 cfgr1 = r->regs[RCC_CFGR1 / 4];
    mm_u32 cfgr2 = r->regs[RCC_CFGR2 / 4];
    mm_u32 sw = cfgr1 & 0x7u;
    mm_u32 hpre = cfgr2 & 0xfu;
    mm_u64 sys = 0;
    mm_u32 div = 1u;

    if (sw == 0u) sys = rcc_hsi_hz(r);
    else if (sw == 1u) sys = 4000000ull;
    else if (sw == 2u) sys = 8000000ull;
    else if (sw == 3u) sys = rcc_pll1_p_clk(r);

    if (hpre >= 8u) {
        switch (hpre) {
        case 8u: div = 2u; break;
        case 9u: div = 4u; break;
        case 10u: div = 8u; break;
        case 11u: div = 16u; break;
        case 12u: div = 64u; break;
        case 13u: div = 128u; break;
        case 14u: div = 256u; break;
        case 15u: div = 512u; break;
        default: div = 1u; break;
        }
    }
    if (sys == 0) {
        r->cpu_hz = 0;
    } else {
        r->cpu_hz = sys / (mm_u64)div;
        if (r->cpu_hz == 0) r->cpu_hz = 1;
    }
    r->regs[RCC_CFGR1 / 4] = (r->regs[RCC_CFGR1 / 4] & ~(0x7u << 3)) | (sw << 3);
}

static mm_bool rcc_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct rcc_state *r = (struct rcc_state *)opaque;
    if (size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > RCC_SIZE) return MM_FALSE;
    memcpy((mm_u8 *)r->regs + offset, &value, size_bytes);
    if (offset == RCC_CR) {
        rcc_update_ready(r);
    }
    if (offset == RCC_BDCR) {
        rcc_update_bdcr(r);
    }
    if (offset == RCC_CFGR1 || offset == RCC_CFGR2 ||
        offset == RCC_PLL1CFGR || offset == RCC_PLL1DIVR ||
        offset == RCC_PLL2CFGR || offset == RCC_PLL3CFGR ||
        offset == RCC_PLL2DIVR || offset == RCC_PLL2FRACR ||
        offset == RCC_PLL3DIVR || offset == RCC_PLL3FRACR ||
        offset == RCC_CR) {
        rcc_update_sysclk(r);
    }
    return MM_TRUE;
}

static mm_bool pwr_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct pwr_state *p = (struct pwr_state *)opaque;
    if (value_out == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > PWR_SIZE) return MM_FALSE;
    memcpy(value_out, (mm_u8 *)p->regs + offset, size_bytes);
    return MM_TRUE;
}

static void pwr_update_vos(struct pwr_state *p)
{
    mm_u32 voscr = p->regs[0x10 / 4];
    mm_u32 vos = (voscr >> 4) & 0x3u;
    mm_u32 vossr = p->regs[0x14 / 4];
    vossr &= ~((1u << 14) | (1u << 13));
    vossr |= (vos << 14);      /* ACTVOS mirrors VOS */
    vossr |= (1u << 13);       /* ACTVOSRDY set */
    vossr |= (1u << 3);        /* VOSRDY set */
    p->regs[0x14 / 4] = vossr;
}

static void pwr_update_usb(struct pwr_state *p)
{
    mm_u32 usbscr = p->regs[0x38 / 4];
    mm_u32 vmsr = p->regs[0x3c / 4];
    if ((usbscr & (1u << 24)) != 0u && (usbscr & (1u << 25)) != 0u) {
        vmsr |= (1u << 24); /* USB33RDY */
    } else {
        vmsr &= ~(1u << 24);
    }
    p->regs[0x3c / 4] = vmsr;
}

static mm_bool pwr_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct pwr_state *p = (struct pwr_state *)opaque;
    if (size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > PWR_SIZE) return MM_FALSE;
    memcpy((mm_u8 *)p->regs + offset, &value, size_bytes);
    if (offset == 0x10u) {
        pwr_update_vos(p);
    }
    if (offset == 0x38u) {
        pwr_update_usb(p);
    }
    return MM_TRUE;
}

static mm_bool simple_blk_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct simple_blk *b = (struct simple_blk *)opaque;
    if (value_out == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > GTZC_BLK_SIZE) return MM_FALSE;
    memcpy(value_out, (mm_u8 *)b->regs + offset, size_bytes);
    return MM_TRUE;
}

static mm_bool simple_blk_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct simple_blk *b = (struct simple_blk *)opaque;
    if (size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > GTZC_BLK_SIZE) return MM_FALSE;
    memcpy((mm_u8 *)b->regs + offset, &value, size_bytes);
    return MM_TRUE;
}

static mm_bool mpcbb_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct mpcbb_state *b = (struct mpcbb_state *)opaque;
    if (value_out == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > MPCBB_SIZE) return MM_FALSE;
    memcpy(value_out, (mm_u8 *)b->regs + offset, size_bytes);
    return MM_TRUE;
}

static mm_bool mpcbb_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct mpcbb_state *b = (struct mpcbb_state *)opaque;
    if (size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > MPCBB_SIZE) return MM_FALSE;
    memcpy((mm_u8 *)b->regs + offset, &value, size_bytes);
    return MM_TRUE;
}

static void mpcbb_init_defaults(void)
{
    mm_u32 bank;
    for (bank = 0; bank < V->mpcbb_count; ++bank) {
        mm_u32 word;
        memset(&mpcbb[bank], 0, sizeof(mpcbb[bank]));
        for (word = 0; word < mpcbb_words[bank]; ++word) {
            mpcbb[bank].regs[(MPCBB_SECCFGR_OFFSET / 4u) + word] = 0xFFFFFFFFu;
        }
    }
}

static mm_bool flash_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct flash_state *f = (struct flash_state *)opaque;
    if (value_out == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > FLASH_SIZE) return MM_FALSE;
    memcpy(value_out, (mm_u8 *)f->regs + offset, size_bytes);
    return MM_TRUE;
}

static mm_bool flash_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct flash_state *f = (struct flash_state *)opaque;
    mm_u32 cr_off;
    mm_u32 sr_off;
    if (size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > FLASH_SIZE) return MM_FALSE;

    if (offset == FLASH_NSKEYR || offset == FLASH_SECKEYR) {
        flash_handle_key(offset, value);
        return MM_TRUE;
    }

    if (offset == FLASH_OPTSR_CUR || offset == FLASH_OPTSR_PRG) {
        mm_u32 new_val = value;
        if (!f->dualbank_enabled) {
            new_val &= ~FLASH_OPTSR_SWAP_BANK;
        }
        f->regs[offset / 4u] = (f->regs[offset / 4u] & ~FLASH_OPTSR_SWAP_BANK) | (new_val & FLASH_OPTSR_SWAP_BANK);
        if (offset == FLASH_OPTSR_PRG) {
            f->regs[FLASH_OPTSR_CUR / 4u] = (f->regs[FLASH_OPTSR_CUR / 4u] & ~FLASH_OPTSR_SWAP_BANK) | (new_val & FLASH_OPTSR_SWAP_BANK);
        }
        flash_set_swap_state(f, (new_val & FLASH_OPTSR_SWAP_BANK) != 0u);
        return MM_TRUE;
    }

    if (offset == FLASH_OTPBLR_CUR) {
        return MM_TRUE;
    }
    if (offset == FLASH_OTPBLR_PRG) {
        mm_u32 cur = f->regs[FLASH_OTPBLR_CUR / 4u];
        mm_u32 set_bits = value & ~cur;
        cur |= set_bits;
        f->regs[FLASH_OTPBLR_CUR / 4u] = cur;
        f->regs[FLASH_OTPBLR_PRG / 4u] = value;
        if (cur == 0xFFFFFFFFu) {
            (void)mm_otp_set_flags(&otp_state, MM_OTP_FLAG_FINAL_LOCK);
        }
        return MM_TRUE;
    }

