danielinux/m33mu/cpu/stm32h5_mmio.c
    /* Unique device ID (non-secure and secure aliases) */
    reg.base = UID_BASE_NS;
    reg.size = UID_SIZE;
    reg.opaque = &uid;
    reg.read = simple_blk_read;
    reg.write = simple_blk_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = UID_BASE_S;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* GTZC TZSC secure */
    reg.base = GTZC_TZSC_S_BASE;
    reg.size = GTZC_TZSC_SIZE;
    reg.opaque = &tzsc_s;
    reg.read = simple_blk_read;
    reg.write = simple_blk_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* GTZC TZSC non-secure alias */
    reg.base = GTZC_TZSC_NS_BASE;
    reg.opaque = &tzsc_ns;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* GTZC TZIC secure */
    reg.base = GTZC_TZIC_S_BASE;
    reg.size = GTZC_TZIC_SIZE;
    reg.opaque = &tzic_s;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* GTZC TZIC non-secure alias */
    reg.base = GTZC_TZIC_NS_BASE;
    reg.opaque = &tzic_ns;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* ICACHE (non-secure and secure aliases) */
    reg.base = ICACHE_BASE;
    reg.size = CACHE_SIZE;
    reg.opaque = &icache;
    reg.read = simple_blk_read;
    reg.write = simple_blk_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = ICACHE_SEC_BASE;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* DCACHE (non-secure and secure aliases) */
    reg.base = DCACHE_BASE;
    reg.size = CACHE_SIZE;
    reg.opaque = &dcache;
    reg.read = simple_blk_read;
    reg.write = simple_blk_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = DCACHE_SEC_BASE;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* MPCBB1..n (non-secure and secure aliases). The controllers are
     * evenly spaced from MPCBB1_BASE, one per SRAM bank. */
    reg.size = MPCBB_SIZE;
    reg.read = mpcbb_read;
    reg.write = mpcbb_write;
    {
        mm_u32 n;
        for (n = 0; n < V->mpcbb_count; ++n) {
            reg.opaque = &mpcbb[n];
            reg.base = MPCBB1_BASE + (n * MPCBB_SIZE);
            if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
            reg.base = MPCBB1_SEC_BASE + (n * MPCBB_SIZE);
            if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
        }
    }

    /* AES (non-secure and secure aliases) */
    reg.base = AES_BASE;
    reg.size = AES_SIZE;
    reg.opaque = &aes_ctx[0];
    reg.read = aes_read;
    reg.write = aes_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = AES_SEC_BASE;
    reg.opaque = &aes_ctx[1];
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* HASH (non-secure and secure aliases) */
    reg.base = HASH_BASE;
    reg.size = HASH_SIZE;
    reg.opaque = &hash_ctx[0];
    reg.read = hash_read;
    reg.write = hash_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = HASH_SEC_BASE;
    reg.opaque = &hash_ctx[1];
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* PKA (non-secure and secure aliases) */
    reg.base = PKA_BASE;
    reg.size = PKA_SIZE;
    reg.opaque = &pka_ctx[0];
    reg.read = pka_read;
    reg.write = pka_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = PKA_SEC_BASE;
    reg.opaque = &pka_ctx[1];
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* OTFDEC (non-secure and secure aliases) */
    if (otfdec_state == 0) {
        otfdec_state = mm_otfdec_new();
    }
    if (otfdec_state != 0) {
        reg.base  = 0x420C5000u;
        reg.size  = 0x400u;
        reg.opaque = otfdec_state;
        reg.read  = mm_otfdec_read;
        reg.write = mm_otfdec_write;
        if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
        reg.base  = 0x520C5000u;
        if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
        mm_spiflash_set_decrypt_hook(mm_otfdec_decrypt_block, otfdec_state);
    }

    /* SAES (non-secure and secure aliases) */
    reg.base = SAES_BASE;
    reg.size = SAES_SIZE;
    reg.opaque = &saes_ctx[0];
    reg.read = aes_read;
    reg.write = aes_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = SAES_SEC_BASE;
    reg.opaque = &saes_ctx[1];
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* RNG (non-secure and secure aliases) */
    reg.base = RNG_BASE;
    reg.size = RNG_SIZE;
    rng_ctx[0][0] = &rng;
    rng_ctx[0][1] = (void *)0;
    rng_ctx[0][2] = &rcc;
    rng_ctx[0][3] = &tzsc_s;
    reg.opaque = rng_ctx[0];
    reg.read = rng_read;
    reg.write = rng_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.base = RNG_SEC_BASE;
    rng_ctx[1][0] = &rng;
    rng_ctx[1][1] = (void *)1;
    rng_ctx[1][2] = rcc_sec;
    rng_ctx[1][3] = &tzsc_s;
    reg.opaque = rng_ctx[1];
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* EXTI (non-secure and secure aliases) */
    reg.base = EXTI_BASE;
    reg.size = EXTI_SIZE;
    reg.opaque = &exti;
    reg.read = exti_read;
    reg.write = exti_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = EXTI_SEC_BASE;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* DBGMCU */
    reg.base = DBGMCU_BASE;
    reg.size = DBGMCU_SIZE;
    reg.opaque = &dbgmcu;
    reg.read = simple_blk_read;
    reg.write = simple_blk_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* IWDG (non-secure and secure aliases) */
    reg.base = IWDG_BASE;
    reg.size = IWDG_SIZE;
    reg.opaque = &iwdg;
    reg.read = iwdg_read;
    reg.write = iwdg_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = IWDG_SEC_BASE;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* WWDG (non-secure and secure aliases) */
    reg.base = WWDG_BASE;
    reg.size = WWDG_SIZE;
    reg.opaque = &wwdg;
    reg.read = wwdg_read;
    reg.write = wwdg_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = WWDG_SEC_BASE;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

