danielinux/m33mu/cpu/stm32h5_mmio.c
    /* GPDMA1/GPDMA2 (non-secure and secure aliases) - using shared implementation */
    reg.size = 0x1000u;
    reg.read = stm32_gpdma_read;
    reg.write = stm32_gpdma_write;
    reg.base = 0x40020000u; /* GPDMA1 */
    reg.opaque = &gpdma1;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = 0x50020000u; /* SEC_GPDMA1 */
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.base = 0x40021000u; /* GPDMA2 */
    reg.opaque = &gpdma2;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = 0x50021000u; /* SEC_GPDMA2 */
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* GPIO A..K: NS alias 0x4202xxxx, Secure alias 0x5202xxxx - using shared implementation */
    {
        mm_u32 base_ns = 0x42020000u;
        mm_u32 base_s  = 0x52020000u;
        int i;
        for (i = 0; i < V->gpio_count; ++i) {
            /* NS */
            reg.base = base_ns + (mm_u32)(i * 0x400u);
            reg.size = STM32_GPIO_REG_SIZE;
            reg.opaque = &gpio_ctx_data[i * 2];
            reg.read = stm32_gpio_read;
            reg.write = stm32_gpio_write;
            if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

            /* Secure */
            reg.base = base_s + (mm_u32)(i * 0x400u);
            reg.opaque = &gpio_ctx_data[i * 2 + 1];
            if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
        }
    }

    if (V->usb_register_mmio != 0 && !V->usb_register_mmio(bus)) return MM_FALSE;
    if (!stm32h5_eth_register_mmio(bus, stm32h5_rcc_regs())) return MM_FALSE;
    if (!stm32h5_i2c_init(bus, 0, V->i2c_count)) return MM_FALSE;
    return MM_TRUE;
}

static void stm32h5_flash_bind_impl(struct mm_memmap *map,
                             mm_u8 *flash,
                             mm_u32 flash_size,
                             const struct mm_flash_persist *persist,
                             mm_u32 flags)
{
    if (map == 0) {
        return;
    }
    flash_ctl.flash = flash;
    flash_ctl.flash_size = flash_size;
    flash_ctl.persist = persist;
    flash_ctl.flags = flags;
    /* The fallback watermark needs the sector size, which is only known now
     * that the flash is bound; registration computed it without one. */
    flash_apply_secwm_fallback(&flash_ctl);
    flash_ctl.base_s = map->flash_base_s;
    flash_ctl.base_ns = map->flash_base_ns;
    flash_ctl.dualbank_enabled = (flags & MM_TARGET_FLAG_DUALBANK) != 0u;
    flash_sync_option_regs(&flash_ctl);
    mm_memmap_set_flash_writer(map, flash_write_cb, &flash_ctl);
    mm_memmap_set_flash_sector_secure(map, flash_sector_secure_cb, &flash_ctl);
}

static void stm32h5_otp_init_impl(const char *target_name)
{
    mm_otp_init(&otp_state, target_name, FLASH_OTP_SIZE);
}

void stm32h5_rng_set_nvic(struct mm_nvic *nvic)
{
    g_rng_nvic = nvic;
}

void stm32h5_gpdma_set_nvic(struct mm_nvic *nvic)
{
    stm32_gpdma_set_nvic(&gpdma1, nvic);
    stm32_gpdma_set_nvic(&gpdma2, nvic);
}

mm_u8 stm32h5_gpio_get_af(int bank, int pin)
{
    if (bank < 0 || bank >= V->gpio_count || pin < 0 || pin >= 16) {
        return 0;
    }
    return stm32_gpio_get_pin_af(&gpio[bank], pin);
}

mm_u8 stm32h5_gpio_get_mode(int bank, int pin)
{
    if (bank < 0 || bank >= V->gpio_count || pin < 0 || pin >= 16) {
        return 0;
    }
    return stm32_gpio_get_pin_mode(&gpio[bank], pin);
}


/* Public entry points. Each of the four a target can reach first latches
 * the variant, so main.c may call them in any order. */

mm_bool stm32h5_register_mmio(const struct stm32h5_mmio_variant *v, struct mmio_bus *bus)
{
    if (v == 0) return MM_FALSE;
    V = v;
    rcc_sec = v->rcc_secure_is_alias ? &rcc : &rcc_s;
    return stm32h5_register_mmio_impl(bus);
}

void stm32h5_mmio_reset(const struct stm32h5_mmio_variant *v)
{
    if (v == 0) return;
    V = v;
    rcc_sec = v->rcc_secure_is_alias ? &rcc : &rcc_s;
    stm32h5_mmio_reset_impl();
}

void stm32h5_flash_bind(const struct stm32h5_mmio_variant *v,
                        struct mm_memmap *map,
                        mm_u8 *flash,
                        mm_u32 flash_size,
                        const struct mm_flash_persist *persist,
                        mm_u32 flags)
{
    if (v == 0) return;
    V = v;
    rcc_sec = v->rcc_secure_is_alias ? &rcc : &rcc_s;
    stm32h5_flash_bind_impl(map, flash, flash_size, persist, flags);
}

void stm32h5_otp_init(const struct stm32h5_mmio_variant *v, const char *target_name)
{
    if (v == 0) return;
    V = v;
    rcc_sec = v->rcc_secure_is_alias ? &rcc : &rcc_s;
    stm32h5_otp_init_impl(target_name);
}
